---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.FinalizedElementsWillBeModifiedWarn
source: html/eddc5911-0a82-b519-31a5-4e416d32cbe5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.FinalizedElementsWillBeModifiedWarn Property

Can't find some new hosts for this Element.\nIt will lose references on Finish Paste unless repositioned or rehosted.

## Syntax (C#)
```csharp
public static FailureDefinitionId FinalizedElementsWillBeModifiedWarn { get; }
```